---
kind: enumMember
id: F:Autodesk.Revit.DB.ImportPlacement.Centered
enum: Autodesk.Revit.DB.ImportPlacement
source: html/3c54b2eb-2378-c692-4c00-46088b684604.htm
---
# Autodesk.Revit.DB.ImportPlacement.Centered

Placement at the Center.
 If reference point is provided, then the import is placed
 so the point is at the model's center. If no point is provided,
 then the document's center is matched with the model's origin.